driver-tests/bpelse/eventHandlers/onAlarm/src/OnAlarmScopeLevelVar/OnAlarmWSDL.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="OnAlarmWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/OnAlarmWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/OnAlarmWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="OnAlarmWSDLOperationRequest">
        <part name="inputString" type="xsd:string"/>
        <part name="duration" type="xsd:duration"/>
        <part name="ID" type="xsd:string"/>
    </message>
    <message name="OnAlarmWSDLOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="OnAlarmWSDLPortType">
        <operation name="OnAlarmWSDLOperation">
            <input name="input1" message="tns:OnAlarmWSDLOperationRequest"/>
            <output name="output1" message="tns:OnAlarmWSDLOperationResponse"/>
        </operation>
    </portType>
    <binding name="OnAlarmWSDLBinding" type="tns:OnAlarmWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="OnAlarmWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/OnAlarmWSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/OnAlarmWSDL"/>
            </output>
        </operation>
    </binding>
    <service name="OnAlarmWSDLService">
        <port name="OnAlarmWSDLPort" binding="tns:OnAlarmWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/OnAlarmWSDLService/OnAlarmWSDLPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="OnAlarmWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="OnAlarmWSDLPortTypeRole" portType="tns:OnAlarmWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
