driver-tests/bpelse/eventHandlers/onAlarmJbi/test/OnAlarmScopeLevelVar/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:onal="http://j2ee.netbeans.org/wsdl/OnAlarmWSDL">
  <soapenv:Body>
    <onal:OnAlarmWSDLOperation>
      <inputString>?string?</inputString>
      <duration>?P8M8DT16H3M5S?</duration>
      <ID>1324234546</ID>
    </onal:OnAlarmWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>